# 绘制房屋面积和房屋价格的关系图

from pylab import *
import matplotlib.pyplot as plt

# 设置说画图中的中文显示问题
mpl.rcParams['font.sans-serif'] = ['SimHei']

# 准备x, y坐标的数据
x = [
    225.98, 247.07, 253.14, 457.85, 241.58, 301.01,
    20.67, 288.64, 163.56, 120.06, 207.83, 342.75,
    147.9, 53.06, 224.72, 29.51, 21.61, 483.21,
    245.25, 399.25, 343.35
]
y = [
    196.63, 203.88, 210.75, 372.74, 202.41, 247.61,
    24.9, 239.34, 140.32, 104.15, 176.84, 288.23,
    128.79, 49.64, 191.74, 33.1, 30.74, 400.02,
    205.35, 330.64, 283.45
]

# 创建画布
plt.figure(figsize=(20, 8), dpi=80)

# 绘制图像
plt.scatter(x, y)

# 添加x轴描述信息
plt.xlabel("x轴")
# 添加y轴描述信息
plt.ylabel("y轴")
# 添加标题
plt.title("房屋面积和房屋价格关系散点图")

# 保存图片
plt.savefig("C:\\Users\\Administrator\\Desktop\\test.jpg")

# 显示图像
plt.show()
